using System;

namespace bsbo_0102_20_lab2
{
    class Program
    {
        static void Main(string[] args)
        {
            // Определить в орграфе сильно связные компоненты, подсчитать их число и вывести состав (номера узлов) каждой сильно связной компоненты.
            // Матрица инцидентности
            Console.WriteLine("Hello World!");
        }
    }
}
